Repository: giellalt/corpus-sme
Catalog: prestable/tmx/nob2sme/facta/skuvlahistorja1/aarseth_s.html.tmx
Source language: sme
Languages: nob

source: Boaittobeale giliid ja muhtumin maiddái lahkamárkana dálumánát vázze internáhttaskuvlla čakčamánus skábmamánnui , ja beassážiin miessemánu lohppii .
nob: Fastboende fra de fjerntliggende grender og til dels også fra nærområdet brukte internatskolen fra september til november , og fra påske til slutten av mai .

source: Badjemánát orro internáhtas skábmamánus beassážiidda , oanehis juovlaluomus gal ledje .
nob: Flyttsamebarn brukte internatet fra november til påske , avbrutt av en knapp juleferie .

source: Máŋggas , geain lei stohpu giliguovddáža lahkosis háliidedje mánáid internáhttii .
nob: Flere som hadde boliger nær bygdesentret ville gjerne ha sine barn på internatet .

source: Nu dahke sihke dálonat ja badjeolbmot .
nob: Dette gjaldt både fastboende og flyttsamer .

source: Dálut eai lean nu ráhpadat ođđasishuksenáigge .
nob: Boligsituasjonen var så som så i gjenreisingstiden .

source: Gaskaboddosaš dálut ledje gáržžit ja bihtáidbargamat bázahalle .
nob: Det var trangt om plassen i de provisoriske boligene og dårlige kår for leksearbeid .

source: Internáhttaoahpaheaddjit bearráigehčče mánáid bihtáidbargamiid diibmu 17.00 ’ rájes gitta 19.00 ´ rádjái , ja dávjá sii maiddái servvoštalle singuin asttuáiggis .
nob: Internatlærerne hadde tilsyn med barnas leksearbeid fra kl. 17 til 19 , og ofte var de også sammen med dem i fritiden .

source: Go skuvla nogai sullii geassemánu 1. beaivve , de barge internáhttaoahpaheaddjit ijat beaivái láhkket ohppiid bevddiid , oljet láhttiid ja rádjat buot skuvlastohpogálvvuid ja dávviriid keallirlatnjii .
nob: Ved skolens slutt omkring l. juni jobbet internatlærerne dag og natt med å lakkere pultene , olje gulvene og stable bort alt skoleinventar og materiell i et rom i kjelleren .

source: De sáhtii Nord-Norsk Hotelldrift ( Davvi-Norgga Hotealladoaibma ) badjelasasváldit dálu ja jođihit guosseviesu golbma geassemánu .
nob: Så kunne Nord-Norsk Hotelldrift overta og drive gjestgiveriet i 3 sommermåneder .

source: Erenoamáš muitu lei ahte galggai váruhit olles áigge ahte petromávssain bisui čuovga .
nob: Et spesielt minne var stressingen med å holde petromaksene i gang .

source: Guosseviesus lei aggregáhta mii attii čuovgga lanjaide ja jurahii oljoliggenmášiinna .
nob: Gjestgiveriet hadde et aggregat som forsynte rommene med lys og holdt oljefyren i gang .

source: Muhto gaskkohagaid , ja erenoamážit dalle go lei buolaš , de aggregáhta billánii .
nob: Men i perioder , og særlig når det var kaldvær , streiket aggregatet .

source: Muhto skuvlla ja internáhttadoaimmahan fertii jođihit .
nob: Men skolen og internatdriften måtte jo holdes i gang .

source: Mii liggiimet garrasit biisiin mii lei áidna klássalanjas .
nob: Det ble fyrt kraftig i peisen i det ene klasserommet i peisestua .

source: Eará lanjain petromáksa attii sihke čuovgga ja lieggasa .
nob: I de andre rommene tjente petromaksen både til belysning og oppvarming .

source: Dát dávjá suovastišgohte ja dalle fertii buhtistit ja pumpet .
nob: Disse gikk ofte " sur " og måtte renses og pumpes .

source: Mun muittán ahte mun máŋgii ijas fertejin lihkkat deavdit parafiinna petromávssaide ja pumpet daid .
nob: Jeg kan huske at jeg flere ganger måtte opp om natta for å fylle parafin på petromaksene og pumpe dem opp .

source: Orron " juhkaluvvan parafiidnahájain " .
nob: Jeg følte at jeg gikk i " parafinrus " .

source: Sosiálalaččat dilihis , muhto maiddái rikkis áigi
nob: En sosialt hektisk , men også rik tid

source: Vaikko internáhtas lei nu nákkis , ja skuvlavahkkut ledje guhkit , de ii oktage váidalan .
nob: Tross trangboddhet og lange skoleuker var det ingen som klaget .

source: Juohke beaivve ledje guhtta skuvladiimmu guhtta beaivvi vahkkus , ja vihtta eahketbeaivve lágiduvvojedje bihtáidlohkamat .
nob: Det var 6 skoletimer pr. dag i 6 dager pr. uke , og med ordnet lekselesing 5 av ettermiddagene .

source: Measta buohkat geat vázze internáhttaskuvlaortnega , vuostáiválde internáhta fálaldaga .
nob: Praktisk talt alle som fulgte internatskoleordningen benyttet seg av tilbudet om internatplass .

source: Lagasbirasorrut maiddái gáibidedje oažžut mánáideaset internáhttaskuvlii .
nob: Det var også et visst press fra nærboende om å ta barna inn på internatskolen .

source: Internáhta biepmut ledje várra apmasat muhtumiidda . "
nob: Kostholdet på internatet virket nok fremmed på enkelte . "

source: Lávvardatsuohkat " lei riidoášši .
nob: Lørdagsgrøten " var en noe kontroversiell sak .

source: Muhtumat liikojedje suohkadii , ja earát fas oaivvildedje ahte dat ii leat olbmoborramuš .
nob: Noen var begeistret for grøt , og andre betraktet den som ubrukbar til menneskeføde .

source: Duosttan dadjat ahte eanaš ruovttut ledje duhtavaččat go lei internáhttafálaldat , ja sin mielas lei buorre veahkkin nákkisvuođas .
nob: Stort sett tør jeg si at hjemmene var glade for internattilbud , og syntes det var en god avlasting i en trangbodd tid .

source: Muhtumin váhnemat muitaledje mo lei skuvlavázzin ovdalgo internáhttaskuvla doaibmagođii .
nob: Av og til fortalte foreldre om hvordan det var å gå på skole før internatet kom i drift .

source: Muhtumat válljejedje vázzit beanagullama skuvlii nuppi guvlui .
nob: Noen foretrakk å gå opp til en mil til skolen hver vei .

source: Earát fas orro olbmuid luhtte , ja sin mielas lei dát hui givssálaš .
nob: Andre var innlosjert privat , og de syntes det var svært utrivelig .

source: Muhtun nissonolmmoš muitalii ahte go son lei 8-jahkásaš ja fertii orrut olbmuid luhtte , de fertii ieš láibut iežas jáffuiguin , ja oađđit láhttis galbma viesus .
nob: En kvinne fortalte at da hun var 8 år og privat innlosjert , måtte hun bake brød selv av egen melsekk og sove på gulvet i et trekkfullt hus .

source: Go su nuorat oarbinat fárrejedje dáid olbmuid lusa , de fertii son ráhkadit borramušaid ja doalahit biktasiid ortnegis maiddái sidjiide .
nob: Da hun fikk yngre søsken til innlosjering , måtte hun lage mat og stelle klærne også for dem.

source: Muhtumin soittii leat buoret dilli , muhto leat han siige geain lea leamaš heajos dilli , geat muitalit dan birra .
nob: Noen hadde det kanskje bedre , men det er jo som regel de som var misfornøyd med tilstanden som gjerne snakker om den .

source: Bargogeatnegasvuođat internáhtas
nob: Arbeidsplikter på internatet

source: Stuorranieiddat láhče beavddi boradansálas .
nob: De store jentene dekket bordene i spisesalen .

source: Sin ledje juohkán bargojoavkkuide , ja vurrolagaid sii basse láhttiid ja távvaliid klássalanjain .
nob: De var inndelt i arbeidspartier , og i tur og orden vasket de gulvet og tavla i klasserommene .

source: Ledje ollosat geat juogadedje dáid bargguid .
nob: Det var mange å deles om jobbene .

source: Stuorragánddat vižže mielkki spánnjain boandadáluin lahkosis .
nob: De store guttene hentet melk i spann fra gårdene omkring .

source: Meieriijat ja buvddat vuovdigohte mielkki easka maŋŋá .
nob: Meieri og butikksalg av melk kom seinere .

source: Boandadáluin mat ledje guhkkelis eret , boanda vuoji buvttii mielkki internáhttii .
nob: Fra gårder lenger borte kjørte bonden melka til internatet .

source: Ii oktage váidalan ahte ohppiid geavahedje dákkár bargguide . Dát barggahanvierru čuovui ovddeš internáhtain , ja orui vuoigat ahte stuorra mánát oassádálle dálubargguin ja sullasaš bargguin go orro nuvttá .
nob: Det kom ikke noen klager over at elevene ble brukt til arbeid av denne art. Dette var en skikk som hang igjen fra de tidligere internater , og det ble funnet rimelig at store barn deltok i husarbeid og lignende når de bodde gratis .

source: Sii ledje hárjánan bargat ruovttus .
nob: De var vant til å måtte delta i arbeid hjemme .

source: Dát barggaheapmi internáhtas lei vissa lága vuostá , muhto dan mii eat diehtán dan áigge .
nob: Sannsynligvis var denne arbeidsvirksomheten på internatet i strid med loven , men det visste vi ikke den gang .

source: Guovdageainnus muittán ahte roagga gándajienat eahketbeaivve huike : " Muorravissui , muorravissui ! "
nob: Fra Kautokeino husker jeg grove guttestemmer som om ettermiddagen ropte : " Muorraviessui , muorraviessui ! "

source: . Stuorra gánddat ledje muorraguoddinjoavkkuide juogaduvvon , ja ledje iežaset ovdaolbmot geat garrasit ádje vuolibuččaideaset muorravissui .
nob: De store guttene var inndelt i vedbærergjenger , og det var deres egne formenn som noe brutalt jaget sine underordnede til vedsjåen .

source: Dilli lei nu ahte sihke gievkkanuvdna , klássalanjaid , oađđensálaid ja eará orrunlanjaid uvnnat ledje liggejuvvon soahkemuoraiguin .
nob: Situasjonen var den at både kjøkkenkomfyren og ovnene i klasserommene , i sovesalene og i andre oppholdsrom var fyrt med bjørkeved .

source: Muoraid bukte internáhttii herggiiguin , ja dát lei lassesisaboahtu máŋgga smávvadálolažžii .
nob: Favnveden ble kjørt til internatet med rein , og dette var en biinntekt for flere småbrukere .

source: Gilioriginála gii maiddái lei gilimusihkkár ( geasanas ) , sahái muoraid giehtasaháin , ja gánddat gudde muoraid sisa .
nob: En bygdeorginal som også var bygdas musikant ( trekkspill ) , sto for vedsagingen med hand , mens skoleguttene sørget for vedbæringen .

source: Jos muittán riekta , de nohke dát barggut maŋŋágo skuvla ja internáhtta fárrehuvvui bissovaš ja ođđaáigásaš vissui .
nob: Såvidt jeg kan huske , bortfalt ovennevnte arbeidsplikter etter at skolen og internatet flyttet over i permanente og moderne lokaler .

source: Sosiálalaš oktavuohta ohppiid gaskkas
nob: Det sosiale samvær mellom elevene

source: Dalle lei guosseviessu boaittobeale márkana ja meahcci lea dastán .
nob: Den gang var gjestgiveriet i ytterkanten av bebyggelsen , med lett adgang til utmarka .

source: Badjemánát asttuáiggis , ja maiddái bottuin , bohccostalle .
nob: Flyttsamebarna brukte sin fritid , ja til og med friminuttene , til å " leke rein " ( bohccostallat ) .

source: Sii dahkaludde ja dáhpádedje ealuid , johtimiid , njorostemiid jna.
nob: De agerte reinflokker , flyttinger , kastet lasso osv.

source: Maiddái dálumánát geat vázze skuvlla giđđat ja čakčat , ledje viššalat leat meahcis iežaset bargguide .
nob: Også de fastboende barn som gikk vår og høst på skolen , brukte utmarka flittig til private aktiviteter .

source: Go internáhttaskuvlla fárrehedje vulos áidojuvvon skuvlašilljui gos maiddái nubbi skuvla lei , de jávkagohte mihtilmas sámi doaimmat bottuin .
nob: Da internatskolen flyttet ned til en inngjerdet skolegård hvor også en annen skole holdt til , ble det mindre av de typisk samiske aktivitetene i friminuttene .

source: Sámegiela geavahedje oahppit gaskaneaset , ja internáhttabargit maiddái muhtumat hálle sámegiela .
nob: Språket var samisk i omgang mellom elevene og til dels med også betjeningen .

source: Muhtun mánát geat eai lean hárjánan sámegiela hállat , čehppo dađistaga sámegiela geavaheamis .
nob: Enkelte barn som ikke var vant til å snakke samisk , ble etter hvert meget flinke i språket .

source: Lei dušše skuvladiimmuin ahte dárogiella lei váldogiella , ja sámegiella geavahuvvui veahkkegiellan . Mu mánnávuođas Guovdageainnus muittán ahte duhkoraddangiella lei sámegiella dálvet , maiddái dan moatti dárogielat máná gaskkas .
nob: Det var bare i skoletimene at norsk var hovedspråket , med samisk som hjelpespråk Fra min barndom i Kautokeino husker jeg at lekespråket var samisk om vinteren , også blant de få norsktalende barna .

source: Internáhttaskuvla duođai nannii sámegiela dili .
nob: Internatskolen bidrog faktisk til å styrke det samiske språks stilling .

source: Juige gal ollu internáhttabirrasis .
nob: Joiking ble utøvet i rikt monn i internatmiljøet .

source: Sii geat máhtte dušše moadde luođi , ohppe máŋga ođđa luođi internáhtas orodettiin .
nob: De som kunne bare noen få joiker , lærte mange nye i internatmiljøet .

source: Ollu čuojahedje " Bongoláikka " , ovttastreaŋggat čuojanasa .
nob: Det ble spilt mye på " Bongolaika " , et enstrengsinstrument .

source: Juoigan ii lean gildojuvvon , muhto unnit mánáid dihtii geat dárbbašedje eanet oađđit , fertii leat jaskat maŋŋá nohkkanáigge .
nob: Det eksisterte ikke noe forbud mot joiking , men av hensyn til de mindre skolebarna som trengte mer søvn , måtte det være ro etter sengetid .

source: Vuollegis juoigan gullui gal maŋŋelaš dán áiggege .
nob: Dempet joik kunne nok høres etter den tid .

source: Mánáid sosiáliseren geat muđui unnán oaidnaledje :
nob: Sosialisering av barn som ellers så lite til hverandre :

source: Badjemánát : Muhtumat johte giđđat gitta Čorgašii Nuorta-Finnmárkui dahje njárgii mii lea Deanuvuona ja Lágesvuona gaskkas , ja muhtumat stuorra njárgii mii lei Lágesvuona ja Porsáŋggu gaskkas ( Kárášjoga nuorttabeallái ) .
nob: Flyttsamebarna : Noen flyttet om våren helt ut til Nordkyn i Øst-Finnmark eller til halvøya mellom Tanafjord og Laksefjord , og noen til den store halvøya mellom Laksefjord og Porsanger ( Karasjok Østfjell ) .

source: Oalle ollu bearrašat johte Porsáŋggu oarjjabeallái , ja Máhkarávjui ja oarjegáissáide .
nob: Ganske mange familier flyttet til det vi kalte Karasjok Vestfjell , som var vestsiden av Porsanger og ut til Magerøya , samt Vest-Gaissene .

source: Sis lei muđui geasset unnán oktavuohta .
nob: De hadde ellers liten kontakt med hverandre i sommerhalvåret .

source: Internáhttaskuvllas sii oahpásmuvve buot orohagaid mánáiguin .
nob: På internatskolen fikk de en bred kontaktflate til barna i alle beitedistrikter .

source: Boaittobeale mánát : Guhkkelis boaittobeale orru mánát bohte Gárdima ja Mollešjoga , Šuoššjávrri ja Iešjohleagi duoddarstobuin , Kárášjoga leagis , Deanu leagis ja Anárjoga leagis .
nob: Spredtboende barn : De fjernt fastboende kom fra fjellstuene Ravnastua og Mollisjok , fra Šuoššjávri og Iešjokdalen , Karasjokdalen , Tanadalen og fra Anarjokdalen .

source: Sis lei unnán dahje ii makkárge oktavuohta earáiguin earretgo internáhttaorodettiin , vaikko máŋggas sis ledje fulkkežagat .
nob: De hadde liten eller ingen kontakt med hverandre utenom internatoppholdet , selv om flere av dem var i slekt med hverandre .

source: Nugo oalle máŋgga eará gilisge , de leat Kárášjogasge leamaš sogat geat árbevirolaččat leat leamaš vuostálagaid .
nob: Som i svært mange andre bygder , har det i Karasjok også eksistert slektsgrupper som har hatt en viss tradisjonell uvilje mot hverandre .

source: Mánát iešguđetge sogas internáhtas deaivvadedje ja ovttasbargodilálašvuođaid bokte várra lahkanedje guhtet guimmiideaset .
nob: Barn fra forskjellige slektsgrupperinger ble på internatet ført sammen og satt inn i samarbeidsforhold som sannsynligvis har ført til mindre distansering .

source: Álgománná internáhtas - mo dovdui ?
nob: Første barn på internatet - hvordan føltes det ?

source: Áidnamánnái dahje mánnajoavkku boarráseamos mánnái fertii leat " garra dilli " fárret internáhttii .
nob: For et enebarn eller eldste barn i en søskenflokk må det ha vært " harde bud " å bli omplantet i internatmiljøet .

source: Ii lean gal mihkkege heahtediliid , muhto lei čielggas ahte muhtumat dovde dorvvohisvuođa ja dovde okto báhcán .
nob: Det gav seg sjelden dramatiske utslag , men det var tydelig at enkelte følte seg utrygge og forlatt .

source: Dávjá muhtun sin fulkkiin lei várjaleaddji , doarjjan sidjiide .
nob: Som oftest fungerte en slektning av disse som en slags " bodyguard " , en støttespiller .

source: Sii veahkehedje gápmagiid suidnet ja biktasiid čavddisin doallat , ja várjaledje sin givssideddjiid vuostá .
nob: De fikk hjelp til å senne skallene og holde klærne i orden , og de ble vernet mot mobbing av støttespilleren .

source: Maŋŋá lean ollu smiehttan ahte livččii berren leat kuráhtor internáhttamánáide , ja erenoamážit bearraša álgománnái gii internáhttii fárrii .
nob: I ettertid har jeg tenkt meget på at det burde vært oppnevnt en kurator for barna på internatet , og spesielt for den første i familien som ble sendt til internatet .

source: Mánáin lea dárbu ollesolbmuin oktavuođa doalahit , ja muhtin eadni dahje áhkku livččii berren oažžut bargun fitnat moddii vahkkus hálešteamen mánáiguin , vaikko ii lean makkárge erenoamáš earán .
nob: Barn har behov for voksenkontakt , og en mor eller bestemor burde ha som oppgave å komme innom et par ganger i uken og prate med barna , uten å ha noe spesielt ærend .

source: Mun muittán boaresbártni gii lei fuolki oalle ollu mánáide ja ristáhčči muhtumiidda .
nob: Jeg kan huske en gammel ungkar som var i slekt med svært mange barn og gudfar til andre .

source: Son lávii fitnat internáhtas hálešteamen mánáiguin ja namahalai sin sámi sohkanamahusaiguin ( iežas ektui ) .
nob: Han pleide å komme innom internatet og prate litt med barna , og tiltale dem med deres samiske slektsbetegnelse ( i relasjon til han selv ) .

source: Son lei čeahppi dárogielas ja váhnemat geavahedje su dávjá dulkan .
nob: Han var flink i norsk og ble ofte brukt som tolk av foreldrene .

source: Sus lei maiddái buorre oktavuohta oahpaheddjiiguin ja internáhttabargiiguin , ja son doaimmai measta bálkkákeahtes kuráhtorin .
nob: Han var også på god talefot med lærerne og internatbetjeningen , og han virket nærmest som en ulønnet kurator .

source: Ruovttumátkeortnet
nob: Hjemreiseordning

source: Internáhttadoaimma vuosttaš jagiid ii lean makkárge ruovttumátkeortnet .
nob: I de første årene med internatdrift eksisterte det ikke noen hjemreiseordning .

source: Váhnemat dolvo mánáid skuvlii ja vižže fas sin go skuvlavuorru nogai .
nob: Foreldrene skysset barna til skolen og hentet dem igjen når skoleturen ( skoleperioden ) var slutt .

source: Nu guhká go lei 6-beaivásaš skuvlavahkku , de lei váttis ollet ruovttus fitnat basiid .
nob: Så lenge det ble praktisert 6 dagers skoleuke , var det vanskelig å finne plass til hjemreisehelger .

source: Go skuvlaáigodat guhkiduvvui ja sierra skuvlaviesut huksejuvvojedje , de lei vejolaš lágidit guhkesbasiid ja ruovttumátkki .
nob: Da skoletiden ble forlenget , og det var reist egne skolebygninger , ble det mulig å ordne med langhelger og hjemreise .

source: Muhto eanaš mánát orro sajiin gosa eai lean birrajagegeainnut dahje ruvttobiillat eai mannan .
nob: Men de fleste barna bodde slik at det ikke fantes helårlige veier eller rutegående transportmidler .

source: Go eanet geainnuid ráhkadedje , de sáhtiimet ordnet ruovttumátkkiid bussiin eanaš ohppiide .
nob: Når veinettet ble bedre utbygd , kunne hjemreiser ordnes med buss for en del av elevene .

source: Jos ii lean vejolaš váhnemiid lusa vuolgit , de muhtumat geavahedje liibba gallestallat fulkkiid .
nob: Om det ikke var mulig å reise til foreldrehjemmet , benyttet noen muligheten til å besøke slektninger .

source: Váhnenoktavuohta
nob: Foreldrekontakt

source: Skuvlainternáhtta doaimmai sosiálalaš oktavuođadoallin .
nob: Skoleinternatet ble et sosialt kontaktpunkt .

source: Dávjá váhnemat eai dušše gallestallan mánáid , muhto oahpaheaddji , ee. lei earánin oažžut dulkot eiseválddiid breavaid ja oažžut veahki vástidit dáid .
nob: Ganske ofte oppsøkte foreldre ikke bare barna , men også en lærer , bl.a. for å få oversatt brev fra en eller annen myndighet og få bistand til å besvare slike .

source: Sosiálkuráhtorat eai gávdnon gilis ovdalgo 1960-logus .
nob: Sosialkurator fantes ikke i bygda før langt ute i 1960-årene .

source: Internáhta váhnenčoahkkimiidda bohte ollu váhnemat , ollu eanet go lágiduvvon biirečoahkkimiidda maidda bohte váhnemat geat orro skuvlla lahkosis .
nob: Foreldremøtene for internatforeldre var meget godt besøkt , langt mere enn de instituerte kretsmøtene som stort sett ble benyttet bare av de som bodde nær skolen .

source: Internáhta váhnenčoahkkimat ledje sosiálalaš dáhpáhusat guossohemiin , ja olbmot aste háleštit oahpaheddjiiguin ja guhtet guimmiideasetguin .
nob: Foreldremøtene på internatet var sosiale begivenheter med bevertning , hvor folk gav seg god tid til å snakke med lærerne og med hverandre .

source: Lei oalle dábálaš ahte váhnemat gallededje oahpaheddjiid ruovttus , ja oalle dávjá oahpaheddjiid geaiguin sáhtte sámegiela hállat .
nob: Hjemmebesøk hos lærere var ikke uvanlig , og temmelig ofte hos lærere som kunne kommunisere på samisk .

source: Lei lunddolaš ahte internáhttaoahpaheaddjit buoremusat dovde boaittobeale bearrašiid ja johttisámebearrašiid geain ledje mánát internáhtas .
nob: Naturlig nok var internatlærerne best kjent med avsidesboende familier og flyttsamefamilier som hadde barn på internatet .

source: Mun duosttan čuoččuhit ahte oktavuohta váhnemiid ja oahpaheddjiid gaskkas lei erenoamáš buorre .
nob: Jeg tror jeg tør si at kontakten mellom foreldre og lærere var usedvanlig god .

source: Internáhtas ii lean radio
nob: Internatet hadde ikke radio

source: Vaikko mánáin lei doarvái bargu skuvllas ja bihtáidbargamiin beaivvi mielde , de berre liikká dál maŋŋá fuomášuhttit ahte máŋggaid jagiid ii lean makkárge lágiduvvon asttuáigefálaldat mánáide . Ovdamearkka dihtii ii gávdnon radio internáhtas .
nob: Sjøl om barna var opptatt med skolegang og leksearbeid det meste av dagen , bør det likevel i ettertid påtales at det i mange år ikke var noe ordnet fritidstilbud for barna , Det fantes f.eks. ikke noen radio på internatet .

source: Nieiddat liikojedje guldalit sávaldatkonseartta ja mánáidbottu .
nob: Jentene var interessert i ønskekonserten og barnetimen .

source: Gánddat liikojedje fas falástallandáhpáhusaid čuovvut nugo skeittásteami ja čuoigama radios bájuhit .
nob: Guttene var særlig interessert i sportsbegivenheter , som skøyteløp og skirenn , som ble referert i radio .

source: Lei duođai healbadeapmi oahpaheddjiid ja jođiiheddjiid bealis go eai gáibidan juolludeaddji eiseválddiid oastit radioapparáhtaid internáhttii .
nob: Det var rett og slett en unnlatelsessynd fra lærernes og ledelsens side at det ikke ble øvet press på bevilgende myndigheter for å anskaffe radioapparater til internatet .

source: Ollu jagiid mielde lei dáhpin šaddan ahte stuorra gánddat bohte min geahčái lávvardaga ja sotnabeaivve go radios ledje sáddagat skeittástan- ja čuoigangilvvuin .
nob: I flere år var det innarbeidet praksis at de store guttene kom hjem til oss lørdag og søndag når det var reportasjer i radio fra skøyteløp og skirenn .

source: Go ledje menddo unnán stuolut , de vealládedje láhttis ja čálle vuorroáiggiid skeittásteamis ja meattildanáiggiid čuoigiide ja njuikemis guhkkodaga .
nob: Når det var for lite stoler , lå de på gulvet og noterte rundetider for skøyteløpene og passeringstider for skiløperne og hopplengder .

source: Dát lei mielamiel guldaleapmi ja čállinhárjáneapmi , ja lei maiddái vuohki dárogiela oahppat .
nob: Det var lystbetont høring og skrivetrening , som også var en måte å lære norsk på .

source: Gánddat hállagohte " reportášagiela " beaivválašságastettiin .
nob: Guttene utviklet etter hvert et " reportasjespråk " i dagligtale .

source: Viimmat oaččuimet Norges Lærerinneforbund-nammasaš searvvis radio mii galggai leat internáhttastobus .
nob: Omsider forærte Norges lærerinneforbund internatet en radio til bruk i internatstua .

source: Muhto dát gánddat geat nu áŋgirit guldaledje gilvvohallamiid ain bohte min geahčái , go unnit mánát nu ridje internáhttastobus .
nob: Men de sterkt sportsinteresserte guttene fortsatte å komme til oss , fordi det var så mye forstyrrelser av de mindre barna i internatstua .

source: Maiddái nieiddat guovlladedje min geahčen basiid .
nob: Også jentene stakk gjerne innom i helgene .

source: Sii liikojedje buoremusat čuožžut gievkkanuksagaskkas ja geahččat go mu eamit barggai .
nob: De likte best å stå i kjøkkendøra og se på når min kone arbeidet . Jeg oppfatter det som et behov for voksenkontakt .

source: Mun dán dulkojin ahte sis lei dárbu ollesolbmuin servvoštallat .
nob: Etter noen år ble det organisert hobbytimer for elevene , bl.a. formingsaktiviteter .
